Repository: MaximilianAzendorf/ba-verlaufsplaner
Catalog: locales/messages.*.xlf
Languages: de

source: Failed module
de: Nicht bestandenes Modul

source: no value
de: kein Wert

source: Specify localizations
de: Mit Übersetzungen

source: No localizations
de: Ohne Übersetzungen

source: Add a module
de: Ein Modul hinzufügen

source: Module passed?
de: Modul bestanden?

source: Hide
de: Verstecken

source: You passed this module.
de: Sie haben dieses Modul bestanden.

source: Undo
de: Rückgängig

source: Short name (optional)
de: Kurzname (optional)

source: Cycle
de: Turnus

source: Required ECTS (optional)
de: Mindest-ECTS (optional)

source: Category
de: Kategorie

source: (no category)
de: (keine Kategorie)

source: Prepone allowed
de: Vorzug erlaubt

source: Prerequisites
de: Voraussetzungen

source: Add prerequisite
de: Voraussetzung hinzufügen

source: Remove module
de: Modul löschen

source: Edit this module
de: Dieses Modul bearbeiten

source: Preponed module
de: Vorgezogenes Modul

source: You are logged in as a maintainer. In maintainer mode, you can edit module data and change or create base plans.
de: Sie sind als Maintainer eingeloggt. Im Maintainer-Modus können Module editiert und Basispläne erstellt oder verändert werden.

source: Compact
de: Kompakt

source: Categories
de: Kategorien

source: Courses
de: Studiengänge

source: Maintainer mode
de: Maintainer-Modus

source: Add module
de: Modul hinzufügen

source: Manage base plans
de: Basispläne verwalten

source: This window allows you to change the base plans of the curriculum planner. {START_TAG_SPAN}Be aware that all changes made to the base plans affect all users.{CLOSE_TAG_SPAN}
de: Dieses Fenster ermöglicht das Ändern und Erstellen von Basisplänen des Planungstools. {START_TAG_SPAN}Achtung: Änderungen an den Basisplänen betreffen alle Benutzer.{CLOSE_TAG_SPAN}

source: View: normal
de: Ansicht: Normal

source: View: compact
de: Ansicht: Kompakt

source: Grouping: categories
de: Gruppierung: Kategorien

source: Grouping: courses
de: Gruppierung: Studiengänge

source: Add a course
de: Einen Studiengang hinzufügen

source: No subplan
de: Kein Sub-Plan

source: Module ID
de: Modul-ID

source: The module ID must not be empty, unique to the plan and has to start with a letter.
de: Die Modul-ID darf nicht leer sein, muss innerhalb des Plans einzigartig sein und muss mit einem Buchstaben beginnen.

source: Select a plan...
de: Einen Plan auswählen...

source: Upload the selected plan as a new base plan
de: Den lokalen Plan als neuen Basisplan hochladen

source: Upload your selected local plan {INTERPOLATION} as a new base plan with a new ID which you can choose in the next step. Note that you have to publish the plan in a second step before it is available to the user.
de: Lädt den lokalen Plan {INTERPOLATION} als einen neuen Basisplan hoch; Sie müssen dafür eine neue, eindeutige Plan-ID wählen. Dadurch wird der neue Plan noch nicht benutzbar; Sie müssen den so erstellten Plan in einem zweiten Schritt veröffentlichen, damit er vom Benutzer verwendet werden kann.

source: Publish this plan
de: Diesen Plan veröffentlichen

source: Publish the selected plan {INTERPOLATION} so it becomes available to the user. {START_TAG_SPAN}Plans can not be deleted once they are published.{CLOSE_TAG_SPAN}
de: Veröffentlicht den ausgewählten Plan {INTERPOLATION}, sodass er für die Benutzer verwendbar wird. {START_TAG_SPAN}Pläne, die einmal veröffentlicht wurden, können nicht mehr gelöscht werden.{CLOSE_TAG_SPAN}

source: Update the base plan of the selected plan
de: Änderungen auf den Basisplan anwenden

source: Upload your changes made to the plan {INTERPOLATION} and apply them to the existing base plan (with the ID {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN}). Consider creating a new version instead before updating existing base plans; changing existing base plans should only be done e.g. to fix mistakes in the respective base plan.
de: Lädt Ihre Änderungen am Plan {INTERPOLATION} hoch und wendet sie auf den Basisplan (mit der ID {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN}) an. Erwägen Sie stattdessen die Erstellung einer neuen Version; Änderungen an existierenden Basisplänen sollten nur aufgrund von Fehlern o.ä. vorgenommen werden.

source: Delete the base plan of the selected plan
de: Den Basisplan des ausgewählten Plans löschen

source: Deletes the base plan (with the ID {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN}) of the selected local plan. {START_TAG_SPAN_1}Only unpublished plans can be deleted.{CLOSE_TAG_SPAN}
de: Löscht den Basisplan (mit der ID {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN}) des ausgewählten lokalen Planes. {START_TAG_SPAN_1}Nur unveröffentlichte Pläne können gelöscht werden.{CLOSE_TAG_SPAN}

source: Confirm action
de: Aktion bestätigen

source: You are about to {START_TAG_SPAN}publish the plan with the ID{CLOSE_TAG_SPAN} {START_TAG_SPAN_1}{INTERPOLATION}{CLOSE_TAG_SPAN}, the name {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN} and version {START_TAG_SPAN}{INTERPOLATION_2}{CLOSE_TAG_SPAN}. Other changes you made will also take effect; make sure the plan is correct. {START_TAG_SPAN}If you publish this plan, you will not be able to delete it anymore.{CLOSE_TAG_SPAN}
de: Sie sind dabei {START_TAG_SPAN}einen Plan zu veröffentlichen.{CLOSE_TAG_SPAN} ID {START_TAG_SPAN_1}{INTERPOLATION}{CLOSE_TAG_SPAN}, Name {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN} und Version {START_TAG_SPAN}{INTERPOLATION_2}{CLOSE_TAG_SPAN}. Änderungen, die Sie am Plan gemacht haben, werden ebenfalls übernommen; überprüfen Sie, ob der Plan korrekt ist. {START_TAG_SPAN}Wenn Sie diesen Plan veröffentlichen kann er nicht mehr gelöscht werden.{CLOSE_TAG_SPAN}

source: Confirm publishing
de: Veröffentlichung bestätigen

source: You are about to {START_TAG_SPAN}create a new base plan{CLOSE_TAG_SPAN} with the name {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN} and version {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN}. Make sure the plan is correct and enter the new unique ID of the new base plan below before confirming this action.
de: Sie sind dabei {START_TAG_SPAN}einen neuen Basisplan{CLOSE_TAG_SPAN} mit Namen {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN} and Version {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN} zu erstellen. Überprüfen Sie die Korrektheit des Plans und vergeben Sie eine neue, eindeutige ID bevor Sie diese Aktion bestätigen.

source: Note that the plan does not become available immediately. You have to publish it as a second step before the user can use this new plan.
de: Beachten Sie, dass der Plan dadurch noch nicht benutzbar wird. Der Plan muss in einem zweiten Schritt veröffentlicht werden, damit Benutzer diesen benutzen können.

source: new unique ID
de: Neue eindeutige ID

source: repeat the ID
de: Die ID wiederholen

source: Create new base plan
de: Neuen Basisplan erstellen

source: You are about to {START_TAG_SPAN}update the base plan with the ID{CLOSE_TAG_SPAN} {START_TAG_SPAN_1}{INTERPOLATION}{CLOSE_TAG_SPAN}, the name {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN} and version {START_TAG_SPAN}{INTERPOLATION_2}{CLOSE_TAG_SPAN}. Make sure the plan is correct and consider creating a new version instead of updating this existing base plan.
de: Sie sind dabei, {START_TAG_SPAN}einen Basisplan zu ändern.{CLOSE_TAG_SPAN} ID {START_TAG_SPAN_1}{INTERPOLATION}{CLOSE_TAG_SPAN}, Name {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN} und Version {START_TAG_SPAN}{INTERPOLATION_2}{CLOSE_TAG_SPAN}. Überprüfen Sie die Korrektheit des Plans und ziehen Sie stattdessen das Erstellen einer neuen Version in Erwägung.

source: Confirm update
de: Änderung bestätigen

source: You are about to {START_TAG_SPAN}delete the base plan with the ID{CLOSE_TAG_SPAN} {START_TAG_SPAN_1}{INTERPOLATION}{CLOSE_TAG_SPAN}, the name {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN} and version {START_TAG_SPAN}{INTERPOLATION_2}{CLOSE_TAG_SPAN}.
de: Sie sind dabei {START_TAG_SPAN}einen Basisplan zu löschen.{CLOSE_TAG_SPAN} ID {START_TAG_SPAN_1}{INTERPOLATION}{CLOSE_TAG_SPAN}, Name {START_TAG_SPAN}{INTERPOLATION_1}{CLOSE_TAG_SPAN} und Version {START_TAG_SPAN}{INTERPOLATION_2}{CLOSE_TAG_SPAN}.

source: Confirm deletion
de: Löschen bestätigen

source: Add
de: Hinzufügen

source: Loading...
de: Lade...

source: Because you are logged in as a maintainer, you can see obsolete and unpublished plans.
de: Sie sind als Maintainer eingeloggt und können deshalb obsolete und unveröffentlichte Pläne sehen.

source: Select a plan version...
de: Eine Version auswählen...

source: New choice ID
de: Neue Wahlmöglichkeits-ID

source: Choice {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN}
de: Wahlmöglichkeit {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN}

source: New alternative ID
de: Neue Alternativen-ID

source: Choices have to contain at least one alternative.
de: Wahlmöglichkeiten müssen mindestens eine Alternative enthalten.

source: Welcome!
de: Wilkommen!

source: To use this application, please {START_LINK}log in{CLOSE_LINK}.
de: Um diese Applikation zu benutzen müssen Sie sich {START_LINK}einloggen{CLOSE_LINK}.

source: Alternatively, you can {START_LINK}try it out locally{CLOSE_LINK}.
de: Alternativ können Sie die Applikation {START_LINK}lokal testen{CLOSE_LINK}.

source: The name of this plan. A user cannot add two or more plans that have the same name (e.g. different versions of the same plan).
de: Der Name dieses Plans. Ein Benutzer kann nicht zwei oder mehr Pläne mit dem selben Namen (z.B. verschiedene Versionen des selben Studiengangs) zu seinem Konto hinzufügen.

source: The version usually is a year and discerns different versions of the same plan (which should share the same name).
de: Die Version ist in der Regel eine Jahreszahl und unterscheidet verschiedene Versionen des selben Studiengangs (die den selben Namen haben sollten).

source: Start terms
de: Mögliche Startsemester

source: In which terms this plan can be started. For example, when only the winter term is checked, users can not select a summer semester as the start semester.
de: In welchen Semestern der Plan gestartet werden kann. Beispielsweise können Nutzer bei einem Plan, der hier nur das Wintersemester angegeben hat, keine Sommersemester als Startsemester auswählen.

source: Settings for {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN} ({INTERPOLATION_1})
de: Einstellungen für {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN} ({INTERPOLATION_1})

source: Migrate plan
de: Plan migrieren

source: Select new base plan...
de: Einen neuen Basisplan auswählen...

source: Migrate to the selected base plan
de: Zum ausgewählten Basisplan migrieren

source: Remove plan
de: Studiengang entfernen

source: Cancel
de: Abbrechen

source: Confirm
de: Bestätigen

source: Properties of {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN}{START_TAG_SPAN_1}new plan{CLOSE_TAG_SPAN} ({INTERPOLATION_1})
de: Eigenschaften von {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN}{START_TAG_SPAN_1}neuem Plan{CLOSE_TAG_SPAN} ({INTERPOLATION_1})

source: Required
de: Pflicht

source: Remove
de: Löschen

source: yes
de: ja

source: no
de: nein

source: Plan choices
de: Wahlmöglichkeiten

source: Plan choices provide several alternatives (containing modules) from which the user has to select exactly one.
de: Wahlmöglichkeiten bestehen aus mehreren Alternativen (die wiederum Module enthalten) aus denen der Benutzer pro Wahlmöglichkeit genau eine auswählen muss.

source: Are you sure?
de: Sind Sie sicher?

source: You are about to remove {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN} from your plan.
de: Sie sind gerade dabei, {START_TAG_SPAN}{INTERPOLATION}{CLOSE_TAG_SPAN} aus ihrem Studienplan zu entfernen.

source: Confirm removal
de: Entfernen bestätigen

source: Total: {PH} CP
de: Insgesamt: {PH} CP

source: Add semester
de: Semester hinzufügen

source: Required prerequisite
de: Zwingende Voraussetzung

source: Recommended prerequisite
de: Empfohlene Voraussetzung

source: Courses are loading...
de: Studiengänge werden geladen...

source: No active courses.
de: Keine aktiven Studiengänge.

source: There was an error
de: Ein Fehler ist aufgetreten

source: Reason: {INTERPOLATION}
de: Grund: {INTERPOLATION}

source: You may need to reload the page. If this problem persists, please report it.
de: Sie müssen die Seite neu laden. Sollte das Problem weiterhin bestehen, bitte melden Sie es an den Betreiber.

source: Reload page
de: Seite neu laden

source: Winter term
de: Wintersemester

source: Summer term
de: Sommersemester

source: Obsolete after
de: Veraltet nach

source: If this date is set, users can not add this plan after the given date and users that already use this plan will get a warning. Consider adding migration options if you make a plan obsolete.
de: Falls hier ein Datum angegeben ist, können Benutzer diesen Plan nach Ablauf dieses Datums nicht mehr zu ihrem Konto hinzufügen. Nutzern, die diesen Plan bereits benutzen, wird eine Warnung angezeigt. In der Regel haben obsolete Pläne Migrationsoptionen.

source: Migratable to
de: Migrierbar zu

source: User can migrate this plan to all plans that are given here. This is usually done for plans that became obsolete because a newer version (to which the old plan sould be migrated) became available.
de: Benutzer können diesen Plan zu allen hier angegebenen Plänen migrieren. Beispielsweise können bei alten Studiengangsversionen die jeweils neuen Versionen hier angegeben werden, um dem Nutzer den Wechsel zur neuen Version zu ermöglichen.

source: Comma-separated list of plan IDs
de: Kommagetrennte Liste von Plan-IDs

source: Add category
de: Kategorie hinzufügen

source: A plan has to have at least one start term.
de: Ein Plan muss mindestens ein mögliches Startsemester haben.

source: Show and edit categories
de: Kategorien anzeigen und bearbeiten

source: Hide categories
de: Kategorien verstecken

source: Show and edit plan choices
de: Wahlmöglichkeiten anzeigen und bearbeiten

source: Hide plan choices
de: Wahlmöglichkeiten verstecken

source: Multiple courses
de: Mehrere Studiengänge

source: No visible courses
de: Keine sichtbaren Studiengänge

source: No courses
de: Keine Studiengänge

source: RWTH Curriculum Planner
de: RWTH Studienverlaufsplaner

source: Show this problem
de: Diese Problem wieder anzeigen

source: Hide this problem
de: Diese Problem verstecken

source: Module
de: Modul

source: Go to this problem
de: Zu diesem Problem gehen

source: Description
de: Beschreibung

source: Redo
de: Wiederholen

source: Add course
de: Studiengang hinzufügen

source: Visible courses
de: Angezeigte Studiengänge

source: Course settings
de: Studiengangs-Einstellungen

source: Hidden Problems
de: Versteckte Probleme

source: Not logged in
de: Nicht eingeloggt

source: Log out
de: Ausloggen

source: Log in
de: Einloggen

source: There is a problem with the server.
de: Es gibt ein Problem mit dem Server.

source: This module has the module "{PH}" as an unmet prerequisite.
de: Diese Modul hat das Modul "{PH}" als eine nicht erfüllte Voraussetzung.

source: This module has the module "{PH}" as an unmet recommended prerequisite.
de: Diese Modul hat das Modul "{PH}" als eine nicht erfüllte empfohlene Voraussetzung.

source: This module has an unmet prerequisite.
de: Diese Modul hat eine nicht erfüllte Voraussetzung.

source: This module has an unmet recommended prerequisite.
de: Diese Modul hat eine nicht erfüllte empfohlene Voraussetzung.

source: This module can only be taken with {PH} CP or more.
de: Diese Modul kann nur mit {PH} CP oder mehr angemeldet werden.

source: The course {PH} has more than 30 CP worth of preponed modules.
de: Die vorgezogenen Module im Studiengang {PH} sind mehr als 30 CP wert.

source: Status of this module is unknown.
de: Der Status des Modul ist unbekannt.

source: The course "{PH}" has no selected choice of "{PH_1}".
de: Für den Studiengang "{PH}" wurde keine Auswahl in "{PH_1}" getroffen.

source: The course "{PH} ({PH_1})" is obsolete and should be migrated to a newer version.
de: Der Studiengang "{PH}" ist nicht mehr gültig und sollte zu einer neueren Version migriert werden.

source: The course "{PH} ({PH_1})" is obsolete.
de: Der Studiengang "{PH}" ist nicht mehr gültig.

source: The plan "{PH} ({PH_1})" is not published.
de: Der Plan "{PH} ({PH_1})" is nicht veröffentlicht.

source: There is a problem with the database.
de: Es gibt ein Problem mit der Datenbank.

source: Your browser may not support the local testing mode; you may have to log in or use a different browser.
de: Möglicherweise unterstützt ihr Browser den lokalen Testmodus nicht. Versuchen Sie sich einzuloggen oder einen anderen Browser zu benutzen.
